RESULT_TWEET_TEXTS = [
    'خدمت شما😉',
    'به این صورت😉',
    'به این شکل😉',
    'اینم از این😉',
    'بفرما😉'
]

MOST_LIKING_USERS_TITLE = """کدوم کاربرها بیش از بقیه توییت‌هات رو لایک کردن؟"""

MOST_LIKED_USERS_TITLE = """تو سال گذشته توییت‌های کدوم کاربرا رو بیش‌تر از بقیه لایک کردی؟"""

PRIVATE_OUTPUT_MESSAGE = "(این لینک موقته و از دسترس خارج می‌شه. عکس رو دانلود کنید تا پیش خودتون داشته باشید)"

START_MSG = """
سلام!

لینک پروفایل توییترت رو تو یه پیام برام بفرست، تا بهت کارنامه‌ی اعمالتو نشون بدم :)
مثلا اینطوری:
https://twitter.com/mh_bahmani

فعلا فقط این که کیارو بیشتر لایک کردی رو میشه دید. بعدا این که کیا بیشتر تو رو لایک کردن هم بهت می‌گم.
"""

ALREADY_STARTED_MSG = """قبلا استارت رو یه بار زدی

لینک پروفایل توییترت رو تو یه پیام برام بفرست، تا بهت کارنامه‌ی اعمالتو نشون بدم :)
مثلا اینطوری:
https://twitter.com/mh_bahmani
"""

error_template = """
تو یه پیام، لینک صفحه‌ی profileت رو برام بفرست. یه چیزی مثل این لینک:
https://twitter.com/mh_bahmani
"""
request_accepted_msg = "درخواستت رفت تو صف. به محض این که آماده بشه، برات می‌فرستمش ✨😌"
already_got_your_request_msg = """
درخواستت رو قبلا گرفتم و تو صف گذاشتم. یه مقدار صبر کن، هر وقت که حاضر شد، برات می‌فرستم.
"""
too_many_requests_msg = """
بیشتر از {} درخواست رو نمی‌تونی بدی و به سقف تعداد درخواست‌هاست رسیدی. فعلا صبر کن تا این سقف رو بیشتر کنم و بتونی دوباره درخواست بدی"""
