RESULT_TWEET_TEXTS = [
    'خدمت شما',
    'به این صورت',
    'به این شکل',
    'هممممم',
    'بفرما'
]

MOST_LIKING_USERS_TITLE = """کدوم کاربرها بیش از بقیه توییت‌هات رو لایک کردن؟"""

MOST_LIKED_USERS_TITLE = """تو سال گذشته توییت‌های کدوم کاربرا رو بیش‌تر از بقیه لایک کردی؟"""

PRIVATE_OUTPUT_MESSAGE = "(این لینک موقته و از دسترس خارج می‌شه. عکس رو دانلود کنید تا پیش خودتون داشته باشید)"

error_template = """
تو یه پیام، لینک صفحه‌ی profileت رو برام بفرست. یه چیزی مثل این لینک:
https://twitter.com/mh_bahmani
"""
request_accepted_msg = "✨ سلام، درخواستت رفت تو صف. به محض این که آماده بشه، برات می‌فرستمش😌"
already_got_your_request_msg = """
یا درخواستت ثبت شده و تو صفه و یا به لیمیت تعداد درخواست رسیدی.
"""
too_many_requests_msg = """
بیشتر از {} درخواست رو نمی‌تونی بدی و به سقف تعداد درخواست‌هاست رسیدی. فعلا صبر کن تا این سقف رو بیشتر کنم و بتونی دوباره درخواست بدی"""
